packs/aviation-cfd-step-v1/templates/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}


application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;           
deltaT          1;

writeControl    timeStep;
writeInterval   100;
purgeWrite      0;

writeFormat     ascii;
writePrecision  12;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;
