packs/aviation-cfd-step-v1/templates/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}










scale   1;

vertices
(
    (-0.05 0.01 0)      
    ( 0    0.01 0)      
    ( 0    0.02 0)      
    (-0.05 0.02 0)      
    ( 0    0    0)      
    ( 0.30 0    0)      
    ( 0.30 0.02 0)      
    (-0.05 0.01 0.01)   
    ( 0    0.01 0.01)   
    ( 0    0.02 0.01)   
    (-0.05 0.02 0.01)   
    ( 0    0    0.01)   
    ( 0.30 0    0.01)   
    ( 0.30 0.02 0.01)   
    ( 0.30 0.01 0)      
    ( 0.30 0.01 0.01)   
);

blocks
(
    
    hex (0 1 2 3 7 8 9 10) (25 20 1) simpleGrading (1 1 1)

    
    
    
    hex (4 5 14 1 11 12 15 8) (140 20 1)
    simpleGrading
    (
        (
            (0.333333 0.714286 1)    
            (0.666667 0.285714 4)    
        )
        ( (1 1 4) )                  
        ( (1 1 1) )
    )

    
    hex (1 14 6 2 8 15 13 9) (140 20 1)
    simpleGrading
    (
        (
            (0.333333 0.714286 1)
            (0.666667 0.285714 4)
        )
        ( (1 1 1) )
        ( (1 1 1) )
    )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 7 10 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 14 15 12)
            (14 6 13 15)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 8 7)       
            (4 11 8 1)      
            (4 5 12 11)     
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (3 10 9 2)
            (2 9 13 6)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (7 8 9 10)
            (4 1 14 5)
            (11 12 15 8)
            (1 2 6 14)
            (8 15 13 9)
        );
    }
);

mergePatchPairs
(
);
