packs/aviation-cfd-step-v1/templates/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}


simulationType  laminar;
